[
    {
        "id": 1,
        "Title": "Avengers: Endgame",
        "Actors": "Robert Downey Jr, Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Chadwick Boseman",
        "Summary": "After Thanos, an intergalactic warlord, disintegrates half of the universe, the Avengers must reunite and assemble again to reinvigorate their trounced allies and restore balance.",
        "Rating": "12A",
        "Directors": "Joe Russo, Anthony Russo",
        "Showtimes": [
            "14:25",
            "17:50",
            "18:30",
            "21:25"
        ],
        "Poster": "https://i.imgur.com/VmLLlbK.jpg"
    },
    {
        "id": 2,
        "Title": "Guardians of the Galaxy",
        "Actors": "Chris Pratt, Zoe Saldana, Dave Bautista, Sean Gunn, Michael Rooker",
        "Summary": "Peter escapes from the planet Morag with a valuable orb that Ronan the Accuser wants. He eventually forms a group with unwilling heroes to stop Ronan.",
        "Rating": "12A",
        "Directors": "James Gunn",
        "Showtimes": [
            "18:00",
            "19:45",
            "21:30",
            "16:00"
        ],
        "Poster": "https://i.imgur.com/grRtRHs.jpg"
    },
    {
        "id": 3,
        "Title": "Up",
        "Actors": "Edward Asner, Jordan Nagai, John Ratzenberger ",
        "Summary": "78-year-old Carl Fredricksen travels to Paradise Falls in his house equipped with balloons, inadvertently taking a young stowaway.",
        "Rating": "U",
        "Directors": "Pete Docter, Bob Peterson",
        "Showtimes": [
            "11:00",
            "14:20",
            "17:30",
            "20:40"
        ],
        "Poster": "https://i.imgur.com/4LN7A1G.jpg"
    },
    {
        "id": 4,
        "Title": "Thor: Ragnarok",
        "Actors": " Chris Hemsworth, Tom Hiddleston, Cate Blanchett",
        "Summary": "Imprisoned on the planet Sakaar, Thor must race against time to return to Asgard and stop Ragnarök, the destruction of his world, at the hands of the powerful and ruthless villain Hela.",
        "Rating": "U",
        "Directors": "Taika Waititi",
        "Showtimes": [
            "13:00",
            "15:20",
            "19:30",
            "21:00"
        ],
        "Poster": "https://i.imgur.com/GWr9lUc.jpg"
    },
    {
        "id": 5,
        "Title": "Avengers: Infinity War",
        "Actors": "Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans",
        "Summary": "The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe.",
        "Rating": "PG-13",
        "Directors": "Anthony Russo, Joe Russo",
        "Showtimes": [
            "11:00",
            "14:20",
            "17:30",
            "20:40"
        ],
        "Poster": "https://i.imgur.com/aouNMIx.jpg"
    },
    {
        "id": 6,
        "Title": "Iron Man 3",
        "Actors": "Robert Downey Jr., Gwyneth Paltrow, Don Cheadle, Guy Pearce, Rebecca Hall, Stéphanie Szostak, James Badge Dale, Jon Favreau,Ben Kingsley",
        "Summary": "Marvel's Iron Man 3 pits brash-but-brilliant industrialist Tony Stark/Iron Man against an enemy whose reach knows no bounds. When Stark finds his personal world destroyed at his enemy's hands, he embarks on a harrowing quest to find those responsible. This journey, at every turn, will test his mettle.",
        "Rating": "12A",
        "Directors": "Shane Black",
        "Showtimes": [
            "14:00",
            "19:00",
            "21:00"
        ],
        "Poster": "https://i.imgur.com/sYIlBfm.jpg"
    }
]